Repository: NikitaBerezhnyj/Bloody
Catalog: lib/l10n/app_*.arb
Languages: es, uk

source: Profile
es: Perfil
uk: Профіль

# welcomeUser
source: Hello, {name} 👋
es: ¡Hola, {name} 👋
uk: Привіт, {name} 👋

# journal
source: Donation Journal
es: Diario de donaciones
uk: Журнал донацій

# stats
source: Statistics
es: Estadísticas
uk: Статистика

source: Too early to donate
es: Todavía es pronto para donar
uk: Ще зарано здавати кров

source: Add Donation
es: Agregar Donación
uk: Додати донацію

# canDonate
source: You can donate blood
es: Puedes donar sangre
uk: Можна здавати кров

# cannotDonate
source: You can donate blood again in {days} days
es: Podrás donar sangre en {days} días
uk: Кров можна здати знову через {days} днів

# motivational1
source: You have donated {count} times — this has saved approximately {countTimesThree} lives!
es: Ha donado {count} veces — ¡esto ha salvado aproximadamente {countTimesThree} vidas!
uk: Ви вже здали {count} разів — це врятувало приблизно {countTimesThree} життів!

# motivational2
source: Your donations ({count}) helped save {countTimesThree} people!
es: Sus donaciones ({count}) ayudaron a salvar {countTimesThree} personas!
uk: Ваші донації ({count}) допомогли врятувати {countTimesThree} людей!

# motivational3
source: Well done, {name}! You have made a good deed {count} times!
es: ¡Bien hecho, {name}! Ha hecho una buena acción {count} veces!
uk: Молодець, {name}! Ви вже {count} разів робили добру справу

# motivational4
source: Amazing! {count} donations is really great, {name}!
es: ¡Impresionante! {count} donaciones son realmente geniales, {name}!
uk: Вражаюче! {count} донацій — це реально круто, {name}!

# motivational5
source: {name}, don't forget — every donation counts. It's been {daysSince} days!
es: {name}, no olvides — cada donación es importante. Han pasado {daysSince} días!
uk: {name}, не забувайте — кожна донація важлива. Минуло вже {daysSince} днів!

# motivational6
source: Your strength helps change the world, {name}!
es: ¡Tu fuerza ayuda a cambiar el mundo, {name}!
uk: Ваша сила допомагає змінювати світ, {name}!

# motivational7
source: {name}, you are a true hero for people around you!
es: ¡{name}, eres un verdadero héroe para la gente que te rodea!
uk: {name}, ви справжній герой для людей навколо!

# motivational8
source: Every drop of blood matters — and you know it!
es: Cada gota de sangre importa — ¡y tú lo sabes!
uk: Кожна крапля крові має значення — і ви це знаєте!

# motivational9
source: Thank you, {name}! The world becomes better thanks to your donations!
es: ¡Gracias, {name}! El mundo se vuelve mejor gracias a tus donaciones!
uk: Дякуємо, {name}! Світ стає кращим завдяки вашим донаціям

# fillProfile
source: Fill your profile
es: Completa tu perfil
uk: Заповніть профіль

source: Name
es: Nombre
uk: Ім’я

# enterName
source: Enter your name
es: Ingrese su nombre
uk: Введіть ім’я

# enterAge
source: Enter your age
es: Ingrese su edad
uk: Введіть вік

# ageValidation
source: Age must be at least 18
es: La edad debe ser al menos 18
uk: Вік має бути від 18 років

source: Gender
es: Género
uk: Стать

source: Select gender
es: Seleccione género
uk: Оберіть стать

source: Blood type
es: Tipo de sangre
uk: Група крові

source: Select blood type
es: Seleccione tipo de sangre
uk: Оберіть групу крові

source: Save
es: Guardar
uk: Зберегти

source: Male
es: Hombre
uk: Чоловік

source: Female
es: Mujer
uk: Жінка

source: Date
es: Fecha
uk: Дата

# selectDate
source: Select a date
es: Seleccione una fecha
uk: Оберіть дату

source: Donation Type
es: Tipo de donación
uk: Тип донації

source: Select donation type
es: Seleccione tipo de donación
uk: Оберіть тип донації

# donationWholeBlood
source: Whole Blood
es: Sangre total
uk: Цільна кров

# donationPlasma
source: Plasma
uk: Плазма

# donationPlatelets
source: Platelets
es: Plaquetas
uk: Тромбоцити

source: Feeling
es: Estado
uk: Самопочуття

# selectFeeling
source: Select your feeling
es: Seleccione su estado
uk: Оберіть самопочуття

source: Notes
es: Notas
uk: Нотатки

# notesHint
source: Additional comments
es: Comentarios adicionales
uk: Додаткові коментарі

source: Save Donation
es: Guardar Donación
uk: Зберегти донацію

# fillAllFields
source: Please fill all required fields
es: Por favor, complete todos los campos obligatorios
uk: Будь ласка, заповніть всі обов'язкові поля

# feelingGood
source: Good
es: Bien
uk: Добре

# feelingNormal
source: Normal
uk: Нормально

# feelingTired
source: Tired
es: Cansado
uk: Втомлений

# journalTitle
source: Donation Journal
es: Diario de Donaciones
uk: Журнал донацій

# noDonations
source: No donations yet
es: Aún no hay donaciones
uk: Поки що немає жодної донації

# feelingLabel
source: Feeling: {feeling}
es: Estado: {feeling}
uk: Самопочуття: {feeling}

# notesLabel
source: Notes: {notes}
es: Notas: {notes}
uk: Нотатки: {notes}

# statsTitle
source: Statistics
es: Estadísticas
uk: Статистика

# noDonationsStats
source: No donations yet
es: Aún no hay donaciones
uk: Ще немає жодної донації

# totalDonations
source: Total donations: {count}
es: Total de donaciones: {count}
uk: Загальна кількість донацій: {count}

# averageInterval
source: Average interval between donations: {days} days
es: Intervalo promedio entre donaciones: {days} días
uk: Середній інтервал між донаціями: {days} днів

source: Donations per month
es: Donaciones por mes
uk: Донації по місяцях

# month1
source: Jan
es: Ene
uk: Січ

# month2
source: Feb
uk: Лют

# month3
source: Mar
uk: Бер

# month4
source: Apr
es: Abr
uk: Кві

# month5
source: May
uk: Тра

# month6
source: Jun
uk: Чер

# month7
source: Jul
uk: Лип

# month8
source: Aug
es: Ago
uk: Сер

# month9
source: Sep
uk: Вер

# month10
source: Oct
uk: Жов

# month11
source: Nov
uk: Лис

# month12
source: Dec
es: Dic
uk: Гру

# profileTitle
source: Profile
es: Perfil
uk: Профіль

# nameLabel
source: Name
es: Nombre
uk: Ім’я

# birthdayLabel
source: Birthday
es: Fecha de nacimiento
uk: Дата народження

# enterBirthday
source: Enter your birthday
es: Ingrese su fecha de nacimiento
uk: Введіть дату народження

# ageMin18
source: Age must be at least 18
es: La edad debe ser al menos 18
uk: Вік має бути від 18 років

# genderLabel
source: Gender
es: Género
uk: Стать

# bloodTypeLabel
source: Blood Type
es: Tipo de sangre
uk: Група крові

source: Save changes
es: Guardar cambios
uk: Зберегти зміни

source: Profile updated!
es: ¡Perfil actualizado!
uk: Профіль оновлено!

source: Logout
es: Cerrar sesión
uk: Вийти з акаунта

# logoutConfirmTitle
source: Logout?
es: ¿Cerrar sesión?
uk: Вийти з акаунта?

# logoutConfirmContent
source: If you logout, all data will be deleted. Are you sure?
es: Si cierra sesión, todos los datos serán eliminados. ¿Está seguro?
uk: Якщо ви вийдете, всі дані будуть видалені. Ви впевнені?

source: Cancel
es: Cancelar
uk: Скасувати

# settingsTitle
source: Settings
es: Configuración
uk: Налаштування

# languageLabel
source: Language:
es: Idioma:
uk: Мова:

# achievementsTitle
source: Achievements
es: Logros
uk: Досягення

# achievementWholeBlood1
source: First Step
es: Primer Paso
uk: Перша кров

# achievementWholeBlood3
source: Braveheart
es: Valiente
uk: Сміливець

# achievementWholeBlood5
source: Red Guardian
es: Guardián Rojo
uk: Червоний захисник

# achievementWholeBlood10
source: Steel Heart
es: Corazón de Acero
uk: Сталеве серце

# achievementWholeBlood25
source: Blood Hero
es: Héroe de la Sangre
uk: Кровний герой

# achievementWholeBlood50
source: Tireless Donor
es: Donante Incansable
uk: Невтомний донор

# achievementWholeBlood100
source: Legend of Life
es: Leyenda de la Vida
uk: Легенда життя

# achievementPlasma1
source: Drop of Kindness
es: Gota de Bondad
uk: Краплина добра

# achievementPlasma3
source: Silver Wave
es: Ola de Plata
uk: Срібна хвиля

# achievementPlasma5
source: Ray of Hope
es: Rayo de Esperanza
uk: Промінь надії

# achievementPlasma10
source: Life Protector
es: Protector de la Vida
uk: Захисник життя

# achievementPlasma25
source: Golden Stream
es: Corriente Dorada
uk: Золотий струм

# achievementPlasma50
source: Plasma Keeper
es: Guardián del Plasma
uk: Хранитель плазми

# achievementPlasma100
source: Immortal Donor
es: Donante Inmortal
uk: Безсмертний донор

# achievementPlatelets1
source: Tiny Hero
es: Pequeño Héroe
uk: Крихітний герой

# achievementPlatelets3
source: Little Rescuer
es: Pequeño Salvador
uk: Маленький рятівник

# achievementPlatelets5
source: White Knight
es: Caballero Blanco
uk: Білий лицар

# achievementPlatelets10
source: Blood Defender
es: Defensor de la Sangre
uk: Захисник крові

# achievementPlatelets25
source: Thrombo-Master
es: Trombo-Maestro
uk: Тромбо-майстер

# achievementPlatelets50
source: Guardian of Life
es: Guardián de la Vida
uk: Вартовий життя

# achievementPlatelets100
source: Rescue Legend
es: Leyenda del Rescate
uk: Легенда порятунку

# achievementWholeBlood1Description
source: Brave beginner – your first drop of whole blood has saved a life.
es: Valiente principiante: tu primera gota de sangre entera ha salvado una vida.
uk: Відважний початківець – твоя перша крапля цільової крові врятувала життя.

# achievementWholeBlood3Description
source: Three steps of courage: you are already on the path of a true donor.
es: Tres pasos de valor: ya estás en el camino de un verdadero donante.
uk: Три кроки від сміливості: ти вже на шляху справжнього донора.

# achievementWholeBlood5Description
source: Red protector: five donations – five lives saved.
es: Protector rojo: cinco donaciones – cinco vidas salvadas.
uk: Червоний захисник: п’ять донацій – п’ять врятованих життів.

# achievementWholeBlood10Description
source: Steel heart: ten times you’ve given hope to those in need.
es: Corazón de acero: diez veces has dado esperanza a quienes lo necesitan.
uk: Сталеве серце: десять разів ти подарував надію тим, хто потребує.

# achievementWholeBlood25Description
source: Blood hero: twenty-five donations – your contribution saves hundreds.
es: Héroe de la sangre: veinticinco donaciones – tu contribución salva cientos.
uk: Кровний герой: двадцять п’ять донацій – твій внесок у порятунок сотень.

# achievementWholeBlood50Description
source: Tireless donor: fifty times you showed true dedication.
es: Donante incansable: cincuenta veces mostraste verdadera dedicación.
uk: Невтомний донор: півсотні разів ти проявив справжню відданість.

# achievementWholeBlood100Description
source: Legend of life: a hundred donations – a legendary feat for humanity.
es: Leyenda de la vida: cien donaciones – una hazaña legendaria para la humanidad.
uk: Легенда життя: сто донацій – легендарний подвиг на користь людства.

# achievementPlasma1Description
source: Drop of kindness: your first plasma donation – small but meaningful.
es: Gota de bondad: tu primera donación de plasma – pequeña pero significativa.
uk: Краплина добра: перша донація плазми – маленький, але важливий внесок.

# achievementPlasma3Description
source: Silver wave: three plasma donations – you already feel the power of helping.
es: Ola plateada: tres donaciones de plasma – ya sientes el poder de ayudar.
uk: Срібна хвиля: три донації плазми – ти вже відчуваєш силу допомоги.

# achievementPlasma5Description
source: Ray of hope: five times your plasma became a ray of life.
es: Rayo de esperanza: cinco veces tu plasma se convirtió en un rayo de vida.
uk: Промінь надії: п’ять разів твоя плазма стала променем життя.

# achievementPlasma10Description
source: Life defender: ten donations – a reliable shield for those in need.
es: Defensor de la vida: diez donaciones – un escudo confiable para quienes lo necesitan.
uk: Захисник життя: десять донацій – ти надійний щит для тих, хто потребує.

# achievementPlasma25Description
source: Golden stream: twenty-five times your plasma gave hope.
es: Corriente dorada: veinticinco veces tu plasma dio esperanza.
uk: Золотий струм: двадцять п’ять разів твоя плазма дарувала надію.

# achievementPlasma50Description
source: Plasma guardian: fifty donations – your help is invaluable.
es: Guardián del plasma: cincuenta donaciones – tu ayuda es invaluable.
uk: Хранитель плазми: півсотні донацій – твоя допомога безцінна.

# achievementPlasma100Description
source: Immortal donor: a hundred donations – your kindness leaves a mark in time.
es: Donante inmortal: cien donaciones – tu bondad deja huella en el tiempo.
uk: Безсмертний донор: сто донацій – твоя доброта залишає слід у часі.

# achievementPlatelets1Description
source: Tiny hero: first platelets – the first step to a great deed.
es: Pequeño héroe: primeras plaquetas – el primer paso hacia una gran hazaña.
uk: Крихітний герой: перші тромбоцити – перший крок до великої справи.

# achievementPlatelets3Description
source: Little rescuer: three platelet donations – you are already changing the world.
es: Pequeño salvador: tres donaciones de plaquetas – ya estás cambiando el mundo.
uk: Маленький рятівник: три донації тромбоцитів – ти вже змінюєш світ.

# achievementPlatelets5Description
source: White knight: five times your platelets became a shield for life.
es: Caballero blanco: cinco veces tus plaquetas se convirtieron en un escudo para la vida.
uk: Білий лицар: п’ять разів твої тромбоцити стали щитом для життя.

# achievementPlatelets10Description
source: Blood defender: ten donations – you are a reliable protector of humanity.
es: Defensor de la sangre: diez donaciones – eres un protector confiable de la humanidad.
uk: Захисник крові: десять донацій – ти надійний оборонець людства.

# achievementPlatelets25Description
source: Thrombo-master: twenty-five donations – mastery in every drop.
es: Maestro trombo: veinticinco donaciones – maestría en cada gota.
uk: Тромбо-майстер: двадцять п’ять донацій – майстерність у кожній краплі.

# achievementPlatelets50Description
source: Life sentinel: fifty platelet donations – your dedication is impressive.
es: Centinela de la vida: cincuenta donaciones de plaquetas – tu dedicación impresiona.
uk: Вартовий життя: півсотні донацій тромбоцитів – твоя відданість вражає.

# achievementPlatelets100Description
source: Legend of rescue: a hundred donations – you are a true hero of humanity.
es: Leyenda del rescate: cien donaciones – eres un verdadero héroe de la humanidad.
uk: Легенда порятунку: сто донацій – ти справжній герой людства.

# achievementOtherTitle
source: Other
es: Otros
uk: Інше

# achievementFirstStep
source: First Step
es: Primer Paso
uk: Перший крок

# achievementFirstStepDescription
source: Creating a profile in the app
es: Creación de un perfil en la aplicación
uk: Створення профілю в додатку

# achievementUniversal
source: Universal Donor
es: Donante Universal
uk: Універсал

# achievementUniversalDescription
source: Donated all types of donations
es: Realizó todos los tipos de donación
uk: Здав усі типи донацій

# achievementHolidayDonor
source: Holiday Donor
es: Donante Festivo
uk: Святковий донор

# achievementHolidayDonorDescription
source: Made a donation on a holiday
es: Hizo una donación en un día festivo
uk: Здача крові в святковий день

# achievementEarlyBird
source: Early Bird
es: Ave madrugadora
uk: Рання пташка

# achievementEarlyBirdDescription
source: Make a donation before 10:00 AM
es: Haz una donación antes de las 10:00 de la mañana
uk: Здійсніть донацію до 10:00 ранку

# shareTitle
source: Share
uk: Поділитись

# emptyDescription
source: No description
uk: Без опису

# shareAchievementText
source: I’ve unlocked the “{title}” achievement in Bloody!
uk: Я здобув досягнення «{title}» у Bloody!

# donationsByType
source: Whole Blood: {wb}, Plasma: {plasma}, Platelets: {platelets}
es: Sangre completa: {wb}, Plasma: {plasma}, Plaquetas: {platelets}

# ageLabel
source: Age
es: Edad
